Revit 2026 API

# LightShape Class

---

This class is the base class for specifying light shape.

SystemObject Autodesk.Revit.DB.LightingLightShape Autodesk.Revit.DB.LightingCircleLightShape Autodesk.Revit.DB.LightingLineLightShape Autodesk.Revit.DB.LightingPointLightShape Autodesk.Revit.DB.LightingRectangleLightShape

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LightShape : IDisposable
```
```vb
Public Class LightShape
	Implements IDisposable
```
```cpp
public ref class LightShape : IDisposable
```
```fsharp
type LightShape =
    class
        interface IDisposable
    end
```

The LightShape type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Creates a copy of the LightShape derived object. |
|  | Dispose | Releases all resources used by the LightShape |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Lighting Namespace